
====== 2019-11-15 01:08:20.716076 ======

Total number of images 46920
Total Train images 32057
Total Test images 14863
Total num images for dataset training, Label 0 is 15673
Total num images for dataset training, Label 1 is 16384
Total num images for dataset testing, Label 0 is 7010
Total num images for dataset testing, Label 1 is 7853
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 17, 17, 32)        896       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 6, 6, 48)          13872     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 3, 3, 48)          0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 3, 3, 48)          0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 1, 1, 64)          27712     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 1, 1, 96)          55392     
_________________________________________________________________
dropout_2 (Dropout)          (None, 1, 1, 96)          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 96)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               24832     
_________________________________________________________________
dropout_3 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 2)                 514       
=================================================================
Total params: 123,218.0
Trainable params: 123,218.0
Non-trainable params: 0.0
_________________________________________________________________

Test accuracy: 88.9793%
Recall: 0.8948172672863873 
Precision: 0.8964153591019263
